def main_menu():
    commands = ['Показать все контакты',
                'Загрузить телефонную книгу',
                'Сохранить телефонную книгу',
                'Создать новый контакт',
                'Изменить контакт',
                'Удалить контакт',
                'Найти контакт',
                'Выйти из программы']

    print(f'\nМеню телефонной книги\n----------------------')
    for i, items in enumerate(commands,1):
        print(f'{i}. {items}')    
    
    while True:
        try:
            user_input = int(input('\nВведите пункт меню:'))
            if 0 < user_input < 9:
                break
            else:
                print('\nВыбор должен быть от 1 до 8')
        except:
            print('\nОШИБКА!!! Выбор должен быть от 1 до 8')
    return user_input

def show_contacts(phone_book: list, user_choice):

    if phone_book:
        if user_choice == 3:
            print('----------------------------------------\n'
                'Контакты, которые будем сохранять: \n'
                '----------------------------------------')
        elif user_choice == 5:
            print('----------------------------------------\n'
                'Контакт, который Вы хотите изменить: \n'
                '----------------------------------------')
        elif user_choice == 6:
            print('----------------------------------------\n'
                'Контакт, который Вы хотите удалить: \n'
                '----------------------------------------')  
        elif user_choice == 7:
            print('----------------------------------------\n'
                  'Найденные контакты: \n'
                  '----------------------------------------') 
        else: 
            print('\nВаша телефонная книга:\n'
                '----------------------------------------')
 
        for i, item in enumerate(phone_book,1):
            print(f'{i}. {item[0]} {item[1]} ({item[2]})')
        print('----------------------------------------')    
    else:
        if user_choice == 1 or user_choice == 3 or user_choice == 8:
            print('----------------------------------------\n'
                  'Телефонная книга пустая или не загружена\n'
                  '----------------------------------------')
        elif user_choice == 6 or user_choice == 7 or user_choice == 5:  
            print('----------------------------------------\n'
                  'Контакт не найден: \n'
                  '----------------------------------------')  

def show_result_choice(user_choice):
    match user_choice:
        case 2:
            print('----------------------------------------\n'
                  'Данные загружены\n'
                  '----------------------------------------')
        case 3:
            print('----------------------------------------\n'
                  'Данные сохранены\n'
                  '----------------------------------------')
        case 4:
            print('----------------------------------------\n'
                  'Контакт добавлен\n'
                  '----------------------------------------')
        case 5:
            print('----------------------------------------\n'
                  'Контакт изменен\n'
                  '----------------------------------------')
        case 6:
            print('----------------------------------------\n'
                  'Контакт удален\n'
                  '----------------------------------------')

def new_contact():
    name = input('Введите Имя и Фамилию контакта: ')
    phone = input('Введите номер телефона контакта: ')
    comment = input('Введите комментарий к контакту: ')
    return name, phone, comment 

def find_contact():
    contact = input('Ищем: ')
    return contact

def del_contact():
    contact = input('Кого удаляем?: ')
    return contact

def get_confirmation():
    confirmation = int(input('Делаем?:\n'
                         '1. Да\n'
                         '2. Нет\n'))
    if confirmation == 1:
        confirmation = True
    elif confirmation == 2:
        confirmation = False
    else:
        print('Укажите 1 или 2')
    return confirmation                                 

def get_clarification(contacts):
    if len(contacts) > 1:
        print('Под Ваши критерии попадают более одного контакта. Попробуйте уточнить поиск')
        return False
    return True

def change_contact():
    contact = input('Кого меняем?: ')
    return contact

def identity_test(test):
    if not test:
        print('---------------------------------------------------\n'
              'Загруженная и текущая телефонные книги не совпадают.\n'
              'Перед выходом можно сохранить изменения?\n'
              '---------------------------------------------------')           